Pics/YCSB/kv_ycsb.log
./kv/release/tests/db/kv_bench --cache_size=8388608 --logpath=/mnt/ssd --db=/mnt/nvm/kv_ycsb --threads=4 --open_files=40000 --num=1500000000 --range=1500000000 --reads=2000000 --partition=100 --write_buffer_size=2097152 --batch_size=1000 --stats_interval=1000000 --bloom_bits=10 --low_pool=3 --high_pool=3 --value_size=100 --direct_io=false --histogram=true --log=true --skiplistrep=true --benchmarks=loadreverse,ycsbc,ycsbb,ycsbd,ycsba,ycsbf,ycsbe,stats --ycsb_ops_num=8000000 --seek_nexts=100 --use_existing_db=true --print_wa=true --log_dio=true --hugepage=true 
Bench num: 1500000000, range: 1500000000
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1500000000
RawSize:    165939.3 MB (estimated)
FileSize:   94413.8 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Write buffer: 2048.00 KB. Compression: 0. 
Restore 716 pivots
Recover seq# 1500104000, log# 1367, min log#1357, file# 115307
using restored pivots
Log_Recover_Time, 0.0000, BucketCount, 716 , Log_size, 0.0 ,MB
loadreverse  : 90606783.000 micros/op 0 ops/sec;
Microseconds per op:
Count: 0 Average: 0.0000  StdDev: 0.00
Min: 0  Median: 0.0000  Max: 0
Percentiles: P50: 0.00 P75: 0.00 P99: 0.00 P99.9: 0.00 P99.99: 0.00
------------------------------------------------------

2019/09/20-00:26:49  ... thread 2: (1000000,1000000) ops and (5713.0,5713.0) ops/second in (175.038194,175.038194) seconds
2019/09/20-00:26:50  ... thread 3: (1000000,1000000) ops and (5691.7,5691.7) ops/second in (175.693039,175.693039) seconds
2019/09/20-00:26:50  ... thread 1: (1000000,1000000) ops and (5687.8,5687.8) ops/second in (175.813887,175.813887) seconds
2019/09/20-00:26:52  ... thread 0: (1000000,1000000) ops and (5601.7,5601.7) ops/second in (178.517088,178.517088) seconds
2019/09/20-00:29:01  ... thread 2: (1000000,2000000) ops and (7572.0,6512.5) ops/second in (132.065321,307.103515) seconds
2019/09/20-00:29:02  ... thread 3: (1000000,2000000) ops and (7582.2,6502.3) ops/second in (131.888461,307.581500) seconds
2019/09/20-00:29:02  ... thread 1: (1000000,2000000) ops and (7578.9,6498.6) ops/second in (131.944972,307.758859) seconds
2019/09/20-00:29:11  ... thread 0: (1000000,2000000) ops and (7200.3,6301.2) ops/second in (138.883502,317.400590) seconds
2019/09/20-00:31:09  ... thread 3: (1000000,3000000) ops and (7844.3,6895.6) ops/second in (127.481088,435.062588) seconds
2019/09/20-00:31:09  ... thread 1: (1000000,3000000) ops and (7831.0,6889.3) ops/second in (127.696912,435.455771) seconds
2019/09/20-00:31:12  ... thread 2: (1000000,3000000) ops and (7644.9,6850.7) ops/second in (130.806600,437.910115) seconds
2019/09/20-00:31:19  ... thread 0: (1000000,3000000) ops and (7847.7,6744.2) ops/second in (127.426520,444.827110) seconds
2019/09/20-00:33:16  ... thread 3: (1000000,4000000) ops and (7850.3,7111.8) ops/second in (127.383650,562.446238) seconds
2019/09/20-00:33:19  ... thread 2: (1000000,4000000) ops and (7849.1,7075.7) ops/second in (127.403614,565.313729) seconds
2019/09/20-00:33:24  ... thread 1: (1000000,4000000) ops and (7445.4,7020.4) ops/second in (134.311689,569.767460) seconds
2019/09/20-00:33:26  ... thread 0: (1000000,4000000) ops and (7854.4,6991.2) ops/second in (127.317250,572.144360) seconds
2019/09/20-00:35:25  ... thread 3: (1000000,5000000) ops and (7796.2,7238.9) ops/second in (128.267999,690.714237) seconds
2019/09/20-00:35:28  ... thread 2: (1000000,5000000) ops and (7782.0,7206.5) ops/second in (128.502163,693.815892) seconds
2019/09/20-00:35:34  ... thread 0: (1000000,5000000) ops and (7788.3,7137.3) ops/second in (128.396950,700.541310) seconds
2019/09/20-00:35:45  ... thread 1: (1000000,5000000) ops and (7067.0,7029.7) ops/second in (141.502673,711.270133) seconds
2019/09/20-00:37:31  ... thread 3: (1000000,6000000) ops and (7886.5,7339.3) ops/second in (126.799458,817.513695) seconds
2019/09/20-00:37:35  ... thread 2: (1000000,6000000) ops and (7886.9,7311.7) ops/second in (126.792311,820.608203) seconds
2019/09/20-00:37:41  ... thread 0: (1000000,6000000) ops and (7893.9,7253.2) ops/second in (126.679802,827.221112) seconds
2019/09/20-00:37:55  ... thread 1: (1000000,6000000) ops and (7728.0,7137.2) ops/second in (129.398886,840.669019) seconds
2019/09/20-00:39:38  ... thread 3: (1000000,7000000) ops and (7882.5,7412.3) ops/second in (126.863358,944.377053) seconds
2019/09/20-00:39:41  ... thread 2: (1000000,7000000) ops and (7912.9,7391.9) ops/second in (126.376661,946.984864) seconds
2019/09/20-00:39:49  ... thread 0: (1000000,7000000) ops and (7797.5,7326.3) ops/second in (128.246271,955.467383) seconds
2019/09/20-00:40:01  ... thread 1: (1000000,7000000) ops and (7911.7,7238.4) ops/second in (126.394680,967.063699) seconds
2019/09/20-00:41:47  ... thread 2: (1000000,8000000) ops and (7914.9,7453.5) ops/second in (126.343204,1073.328068) seconds
2019/09/20-00:41:50  ... thread 3: (1000000,8000000) ops and (7604.0,7435.7) ops/second in (131.510269,1075.887322) seconds
2019/09/20-00:41:55  ... thread 0: (1000000,8000000) ops and (7928.4,7396.5) ops/second in (126.129505,1081.596888) seconds
2019/09/20-00:42:06  ... thread 1: (1000000,8000000) ops and (7972.7,7322.7) ops/second in (125.428206,1092.491905) seconds
ycsbc        :      34.143 micros/op 29288 ops/sec;    3.2 MB/s (8000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 135.1033  StdDev: 22.93
Min: 2  Median: 133.7799  Max: 240653
Percentiles: P50: 133.78 P75: 165.06 P99: 530.76 P99.9: 836.01 P99.99: 15309.35
------------------------------------------------------
(       1,       2 ]        6   0.000%   0.000% 
(       2,       3 ]      531   0.002%   0.002% 
(       3,       4 ]    14884   0.047%   0.048% 
(       4,       6 ]   830084   2.594%   2.642% #
(       6,      10 ]  2686028   8.394%  11.036% ##
(      10,      15 ]  2749564   8.592%  19.628% ##
(      15,      22 ]  1609223   5.029%  24.657% #
(      22,      34 ]   602145   1.882%  26.539% 
(      34,      51 ]   158772   0.496%  27.035% 
(      51,      76 ]    37340   0.117%  27.152% 
(      76,     110 ]  1230268   3.845%  30.996% #
(     110,     170 ] 15343591  47.949%  78.945% ##########
(     170,     250 ]  3575597  11.174%  90.119% ##
(     250,     380 ]  2138911   6.684%  96.803% #
(     380,     580 ]   932678   2.915%  99.718% #
(     580,     870 ]    66128   0.207%  99.924% 
(     870,    1300 ]     7234   0.023%  99.947% 
(    1300,    1900 ]     2864   0.009%  99.956% 
(    1900,    2900 ]     3136   0.010%  99.966% 
(    2900,    4400 ]     2891   0.009%  99.975% 
(    4400,    6600 ]     1838   0.006%  99.980% 
(    6600,    9900 ]     1408   0.004%  99.985% 
(    9900,   14000 ]     1224   0.004%  99.989% 
(   14000,   22000 ]     2780   0.009%  99.997% 
(   22000,   33000 ]      752   0.002% 100.000% 
(   33000,   50000 ]       68   0.000% 100.000% 
(   50000,   75000 ]       19   0.000% 100.000% 
(   75000,  110000 ]       12   0.000% 100.000% 
(  110000,  170000 ]       20   0.000% 100.000% 
(  170000,  250000 ]        4   0.000% 100.000% 

2019/09/20-00:44:13  ... thread 2: (1000000,1000000) ops and (8066.8,8066.8) ops/second in (123.965219,123.965219) seconds
2019/09/20-00:44:13  ... thread 0: (1000000,1000000) ops and (8054.0,8054.0) ops/second in (124.161654,124.161654) seconds
2019/09/20-00:44:13  ... thread 3: (1000000,1000000) ops and (8059.7,8059.7) ops/second in (124.074640,124.074640) seconds
2019/09/20-00:44:27  ... thread 1: (1000000,1000000) ops and (7252.7,7252.7) ops/second in (137.878785,137.878785) seconds
2019/09/20-00:46:16  ... thread 2: (1000000,2000000) ops and (8093.3,8080.0) ops/second in (123.559493,247.524712) seconds
2019/09/20-00:46:16  ... thread 0: (1000000,2000000) ops and (8096.0,8074.9) ops/second in (123.518314,247.679968) seconds
2019/09/20-00:46:19  ... thread 3: (1000000,2000000) ops and (7921.2,7989.8) ops/second in (126.242982,250.317622) seconds
2019/09/20-00:46:37  ... thread 1: (1000000,2000000) ops and (7664.5,7452.9) ops/second in (130.471372,268.350157) seconds
2019/09/20-00:48:20  ... thread 2: (1000000,3000000) ops and (8104.2,8088.0) ops/second in (123.392896,370.917608) seconds
2019/09/20-00:48:23  ... thread 3: (1000000,3000000) ops and (8086.9,8021.9) ops/second in (123.656547,373.974169) seconds
2019/09/20-00:48:25  ... thread 0: (1000000,3000000) ops and (7776.5,7973.0) ops/second in (128.592223,376.272191) seconds
2019/09/20-00:48:43  ... thread 1: (1000000,3000000) ops and (7934.3,7606.8) ops/second in (126.034629,394.384786) seconds
2019/09/20-00:50:26  ... thread 3: (1000000,4000000) ops and (8106.2,8042.8) ops/second in (123.362647,497.336816) seconds
2019/09/20-00:50:27  ... thread 2: (1000000,4000000) ops and (7830.4,8022.1) ops/second in (127.706850,498.624458) seconds
2019/09/20-00:50:33  ... thread 0: (1000000,4000000) ops and (7791.8,7926.9) ops/second in (128.339611,504.611802) seconds
2019/09/20-00:50:47  ... thread 1: (1000000,4000000) ops and (8081.7,7720.2) ops/second in (123.736926,518.121712) seconds
2019/09/20-00:52:30  ... thread 3: (1000000,5000000) ops and (8067.3,8047.7) ops/second in (123.957504,621.294320) seconds
2019/09/20-00:52:34  ... thread 2: (1000000,5000000) ops and (7870.9,7991.4) ops/second in (127.050231,625.674689) seconds
2019/09/20-00:52:37  ... thread 0: (1000000,5000000) ops and (8087.1,7958.4) ops/second in (123.653091,628.264893) seconds
2019/09/20-00:52:59  ... thread 1: (1000000,5000000) ops and (7599.5,7695.7) ops/second in (131.587809,649.709521) seconds
2019/09/20-00:54:33  ... thread 3: (1000000,6000000) ops and (8130.1,8061.3) ops/second in (122.999652,744.293972) seconds
2019/09/20-00:54:37  ... thread 2: (1000000,6000000) ops and (8134.5,8014.9) ops/second in (122.933604,748.608293) seconds
2019/09/20-00:54:40  ... thread 0: (1000000,6000000) ops and (8139.3,7988.0) ops/second in (122.860782,751.125675) seconds
2019/09/20-00:55:11  ... thread 1: (1000000,6000000) ops and (7546.9,7670.5) ops/second in (132.505339,782.214860) seconds
2019/09/20-00:56:40  ... thread 3: (1000000,7000000) ops and (7893.9,8037.0) ops/second in (126.680298,870.974270) seconds
2019/09/20-00:56:43  ... thread 2: (1000000,7000000) ops and (7937.0,8003.7) ops/second in (125.992387,874.600680) seconds
2019/09/20-00:56:47  ... thread 0: (1000000,7000000) ops and (7846.1,7967.4) ops/second in (127.451239,878.576914) seconds
2019/09/20-00:57:21  ... thread 1: (1000000,7000000) ops and (7673.6,7671.0) ops/second in (130.316143,912.531003) seconds
2019/09/20-00:58:47  ... thread 2: (1000000,8000000) ops and (8095.4,8015.0) ops/second in (123.527531,998.128211) seconds
2019/09/20-00:58:50  ... thread 0: (1000000,8000000) ops and (8119.0,7986.1) ops/second in (123.167592,1001.744506) seconds
2019/09/20-00:58:51  ... thread 3: (1000000,8000000) ops and (7628.3,7983.5) ops/second in (131.091653,1002.065923) seconds
2019/09/20-00:59:23  ... thread 1: (1000000,8000000) ops and (8230.6,7736.7) ops/second in (121.498389,1034.029392) seconds
ycsbb        :      32.319 micros/op 30941 ops/sec;    3.4 MB/s (7599999 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 126.1240  StdDev: 28.92
Min: 1  Median: 131.3114  Max: 176518
Percentiles: P50: 131.31 P75: 164.26 P99: 512.62 P99.9: 700.71 P99.99: 2450.18
------------------------------------------------------
[       0,       1 ]      253   0.001%   0.001% 
(       1,       2 ]     4299   0.013%   0.014% 
(       2,       3 ]    11332   0.035%   0.050% 
(       3,       4 ]    47683   0.149%   0.199% 
(       4,       6 ]   403146   1.260%   1.458% 
(       6,      10 ]  3150676   9.846%  11.304% ##
(      10,      15 ]  2794152   8.732%  20.036% ##
(      15,      22 ]  2274640   7.108%  27.144% #
(      22,      34 ]   926172   2.894%  30.039% #
(      34,      51 ]   233083   0.728%  30.767% 
(      51,      76 ]    45302   0.142%  30.909% 
(      76,     110 ]   935301   2.923%  33.831% #
(     110,     170 ] 14566742  45.521%  79.352% #########
(     170,     250 ]  3724320  11.639%  90.991% ##
(     250,     380 ]  2031010   6.347%  97.338% #
(     380,     580 ]   802104   2.507%  99.844% #
(     580,     870 ]    42729   0.134%  99.978% 
(     870,    1300 ]     1949   0.006%  99.984% 
(    1300,    1900 ]     1008   0.003%  99.987% 
(    1900,    2900 ]     1634   0.005%  99.992% 
(    2900,    4400 ]     1052   0.003%  99.996% 
(    4400,    6600 ]      914   0.003%  99.998% 
(    6600,    9900 ]       65   0.000%  99.999% 
(    9900,   14000 ]      110   0.000%  99.999% 
(   14000,   22000 ]      238   0.001% 100.000% 
(   22000,   33000 ]       82   0.000% 100.000% 
(  110000,  170000 ]        2   0.000% 100.000% 
(  170000,  250000 ]        2   0.000% 100.000% 

2019/09/20-01:01:12  ... thread 0: (1000000,1000000) ops and (9447.3,9447.3) ops/second in (105.850521,105.850521) seconds
2019/09/20-01:01:13  ... thread 2: (1000000,1000000) ops and (9346.1,9346.1) ops/second in (106.996464,106.996464) seconds
2019/09/20-01:01:15  ... thread 1: (1000000,1000000) ops and (9293.6,9293.6) ops/second in (107.601304,107.601304) seconds
2019/09/20-01:01:19  ... thread 3: (1000000,1000000) ops and (8968.5,8968.5) ops/second in (111.501515,111.501515) seconds
2019/09/20-01:02:56  ... thread 1: (1000000,2000000) ops and (9908.0,9591.0) ops/second in (100.928530,208.529834) seconds
2019/09/20-01:02:57  ... thread 0: (1000000,2000000) ops and (9540.5,9493.7) ops/second in (104.816218,210.666739) seconds
2019/09/20-01:03:00  ... thread 3: (1000000,2000000) ops and (9917.4,9419.1) ops/second in (100.832622,212.334137) seconds
2019/09/20-01:03:00  ... thread 2: (1000000,2000000) ops and (9385.7,9365.9) ops/second in (106.544612,213.541076) seconds
2019/09/20-01:04:40  ... thread 1: (1000000,3000000) ops and (9606.3,9596.1) ops/second in (104.097815,312.627649) seconds
2019/09/20-01:04:41  ... thread 3: (1000000,3000000) ops and (9849.2,9558.3) ops/second in (101.530846,313.864983) seconds
2019/09/20-01:04:41  ... thread 2: (1000000,3000000) ops and (9852.1,9522.5) ops/second in (101.500820,315.041896) seconds
2019/09/20-01:04:46  ... thread 0: (1000000,3000000) ops and (9135.6,9371.2) ops/second in (109.461514,320.128253) seconds
2019/09/20-01:06:22  ... thread 3: (1000000,4000000) ops and (9901.1,9641.7) ops/second in (100.999079,414.864062) seconds
2019/09/20-01:06:23  ... thread 2: (1000000,4000000) ops and (9889.5,9611.7) ops/second in (101.116916,416.158812) seconds
2019/09/20-01:06:28  ... thread 0: (1000000,4000000) ops and (9897.2,9497.4) ops/second in (101.038452,421.166705) seconds
2019/09/20-01:06:28  ... thread 1: (1000000,4000000) ops and (9255.9,9508.7) ops/second in (108.038668,420.666317) seconds
2019/09/20-01:08:05  ... thread 3: (1000000,5000000) ops and (9746.9,9662.6) ops/second in (102.596752,517.460814) seconds
2019/09/20-01:08:09  ... thread 0: (1000000,5000000) ops and (9880.8,9571.7) ops/second in (101.206825,522.373530) seconds
2019/09/20-01:08:10  ... thread 1: (1000000,5000000) ops and (9843.2,9573.8) ops/second in (101.593326,522.259643) seconds
2019/09/20-01:08:14  ... thread 2: (1000000,5000000) ops and (8993.1,9481.3) ops/second in (111.195775,527.354587) seconds
2019/09/20-01:09:48  ... thread 3: (1000000,6000000) ops and (9645.2,9659.7) ops/second in (103.678217,621.139031) seconds
2019/09/20-01:09:50  ... thread 0: (1000000,6000000) ops and (9894.1,9624.0) ops/second in (101.070518,623.444048) seconds
2019/09/20-01:09:51  ... thread 1: (1000000,6000000) ops and (9875.1,9622.7) ops/second in (101.265304,623.524947) seconds
2019/09/20-01:10:01  ... thread 2: (1000000,6000000) ops and (9296.3,9449.9) ops/second in (107.570216,634.924803) seconds
2019/09/20-01:11:31  ... thread 0: (1000000,7000000) ops and (9888.2,9660.8) ops/second in (101.130492,724.574540) seconds
2019/09/20-01:11:33  ... thread 1: (1000000,7000000) ops and (9846.6,9654.1) ops/second in (101.558314,725.083261) seconds
2019/09/20-01:11:41  ... thread 3: (1000000,7000000) ops and (8910.5,9545.0) ops/second in (112.226632,733.365663) seconds
2019/09/20-01:11:43  ... thread 2: (1000000,7000000) ops and (9851.5,9505.3) ops/second in (101.507346,736.432149) seconds
2019/09/20-01:13:12  ... thread 0: (1000000,8000000) ops and (9893.8,9689.4) ops/second in (101.073494,825.648034) seconds
2019/09/20-01:13:14  ... thread 1: (1000000,8000000) ops and (9820.0,9674.5) ops/second in (101.832853,826.916114) seconds
2019/09/20-01:13:24  ... thread 2: (1000000,8000000) ops and (9881.5,9550.7) ops/second in (101.199382,837.631531) seconds
2019/09/20-01:13:29  ... thread 3: (1000000,8000000) ops and (9234.7,9505.1) ops/second in (108.287088,841.652751) seconds
ycsbd        :      26.332 micros/op 37976 ops/sec;    4.2 MB/s (7600000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 104.1203  StdDev: 119.78
Min: 1  Median: 115.8784  Max: 29337
Percentiles: P50: 115.88 P75: 156.76 P99: 484.87 P99.9: 579.87 P99.99: 1052.74
------------------------------------------------------
[       0,       1 ]      509   0.002%   0.002% 
(       1,       2 ]    12056   0.038%   0.039% 
(       2,       3 ]    24990   0.078%   0.117% 
(       3,       4 ]    45310   0.142%   0.259% 
(       4,       6 ]   461571   1.442%   1.701% 
(       6,      10 ]  5118424  15.995%  17.696% ###
(      10,      15 ]  4448444  13.901%  31.598% ###
(      15,      22 ]  2687564   8.399%  39.996% ##
(      22,      34 ]   885336   2.767%  42.763% #
(      34,      51 ]   145766   0.456%  43.219% 
(      51,      76 ]    24736   0.077%  43.296% 
(      76,     110 ]   995042   3.110%  46.405% #
(     110,     170 ] 11740433  36.689%  83.094% #######
(     170,     250 ]  3212867  10.040%  93.135% ##
(     250,     380 ]  1559021   4.872%  98.006% #
(     380,     580 ]   606330   1.895%  99.901% 
(     580,     870 ]    27979   0.087%  99.989% 
(     870,    1300 ]      993   0.003%  99.992% 
(    1300,    1900 ]      551   0.002%  99.994% 
(    1900,    2900 ]      933   0.003%  99.996% 
(    2900,    4400 ]      285   0.001%  99.997% 
(    4400,    6600 ]      510   0.002%  99.999% 
(    6600,    9900 ]        7   0.000%  99.999% 
(    9900,   14000 ]       55   0.000%  99.999% 
(   14000,   22000 ]      190   0.001% 100.000% 
(   22000,   33000 ]       98   0.000% 100.000% 

2019/09/20-01:14:39  ... thread 2: (1000000,1000000) ops and (14688.3,14688.3) ops/second in (68.081511,68.081511) seconds
2019/09/20-01:14:40  ... thread 1: (1000000,1000000) ops and (14495.9,14495.9) ops/second in (68.984899,68.984899) seconds
2019/09/20-01:14:42  ... thread 3: (1000000,1000000) ops and (14147.3,14147.3) ops/second in (70.684938,70.684938) seconds
2019/09/20-01:14:43  ... thread 0: (1000000,1000000) ops and (13999.8,13999.8) ops/second in (71.429509,71.429509) seconds
2019/09/20-01:15:51  ... thread 2: (1000000,2000000) ops and (13963.6,14316.8) ops/second in (71.614622,139.696133) seconds
2019/09/20-01:15:54  ... thread 0: (1000000,2000000) ops and (14101.0,14050.2) ops/second in (70.916864,142.346373) seconds
2019/09/20-01:15:54  ... thread 3: (1000000,2000000) ops and (13893.5,14019.2) ops/second in (71.976152,142.661090) seconds
2019/09/20-01:15:56  ... thread 1: (1000000,2000000) ops and (13177.5,13805.3) ops/second in (75.887101,144.872000) seconds
2019/09/20-01:17:02  ... thread 3: (1000000,3000000) ops and (14681.1,14233.1) ops/second in (68.114869,210.775959) seconds
2019/09/20-01:17:03  ... thread 2: (1000000,3000000) ops and (13937.9,14188.2) ops/second in (71.746829,211.442962) seconds
2019/09/20-01:17:04  ... thread 1: (1000000,3000000) ops and (14713.9,14095.4) ops/second in (67.962916,212.834916) seconds
2019/09/20-01:17:04  ... thread 0: (1000000,3000000) ops and (14134.2,14078.1) ops/second in (70.750625,213.096998) seconds
2019/09/20-01:18:13  ... thread 2: (1000000,4000000) ops and (14169.2,14183.5) ops/second in (70.575368,282.018330) seconds
2019/09/20-01:18:14  ... thread 1: (1000000,4000000) ops and (14226.4,14127.9) ops/second in (70.291959,283.126875) seconds
2019/09/20-01:18:16  ... thread 3: (1000000,4000000) ops and (13419.4,14020.6) ops/second in (74.519075,285.295034) seconds
2019/09/20-01:18:17  ... thread 0: (1000000,4000000) ops and (13716.6,13985.9) ops/second in (72.904369,286.001367) seconds
2019/09/20-01:19:26  ... thread 2: (1000000,5000000) ops and (13763.4,14097.4) ops/second in (72.656648,354.674978) seconds
2019/09/20-01:19:28  ... thread 1: (1000000,5000000) ops and (13678.4,14035.7) ops/second in (73.108002,356.234877) seconds
2019/09/20-01:19:30  ... thread 0: (1000000,5000000) ops and (13682.4,13924.2) ops/second in (73.086780,359.088147) seconds
2019/09/20-01:19:30  ... thread 3: (1000000,5000000) ops and (13514.4,13916.3) ops/second in (73.995315,359.290349) seconds
2019/09/20-01:20:38  ... thread 2: (1000000,6000000) ops and (13968.8,14075.8) ops/second in (71.587861,426.262839) seconds
2019/09/20-01:20:42  ... thread 1: (1000000,6000000) ops and (13400.9,13925.7) ops/second in (74.621783,430.856660) seconds
2019/09/20-01:20:42  ... thread 3: (1000000,6000000) ops and (13940.1,13920.3) ops/second in (71.735508,431.025857) seconds
2019/09/20-01:20:42  ... thread 0: (1000000,6000000) ops and (13888.2,13918.2) ops/second in (72.003566,431.091713) seconds
2019/09/20-01:21:47  ... thread 2: (1000000,7000000) ops and (14322.4,14110.5) ops/second in (69.820898,496.083737) seconds
2019/09/20-01:21:52  ... thread 3: (1000000,7000000) ops and (14320.7,13976.1) ops/second in (69.829039,500.854896) seconds
2019/09/20-01:21:52  ... thread 0: (1000000,7000000) ops and (14293.0,13970.5) ops/second in (69.964357,501.056070) seconds
2019/09/20-01:21:57  ... thread 1: (1000000,7000000) ops and (13287.6,13830.9) ops/second in (75.258278,506.114938) seconds
2019/09/20-01:22:58  ... thread 2: (1000000,8000000) ops and (14176.4,14118.7) ops/second in (70.539892,566.623629) seconds
2019/09/20-01:23:02  ... thread 3: (1000000,8000000) ops and (14286.6,14014.2) ops/second in (69.995745,570.850641) seconds
2019/09/20-01:23:06  ... thread 0: (1000000,8000000) ops and (13548.3,13916.3) ops/second in (73.809855,574.865925) seconds
2019/09/20-01:23:07  ... thread 1: (1000000,8000000) ops and (14279.7,13885.4) ops/second in (70.029591,576.144529) seconds
ycsba        :      18.009 micros/op 55528 ops/sec;    6.1 MB/s (4000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 71.5151  StdDev: 52.34
Min: 1  Median: 13.2694  Max: 178819
Percentiles: P50: 13.27 P75: 135.33 P99: 442.29 P99.9: 587.05 P99.99: 2760.49
------------------------------------------------------
[       0,       1 ]      252   0.001%   0.001% 
(       1,       2 ]     9580   0.030%   0.031% 
(       2,       3 ]   207754   0.649%   0.680% 
(       3,       4 ]  1689563   5.280%   5.960% #
(       4,       6 ]  5725216  17.891%  23.851% ####
(       6,      10 ]  6133695  19.168%  43.019% ####
(      10,      15 ]  3416420  10.676%  53.695% ##
(      15,      22 ]  2225320   6.954%  60.649% #
(      22,      34 ]   796098   2.488%  63.137% 
(      34,      51 ]   118937   0.372%  63.509% 
(      51,      76 ]    19974   0.062%  63.571% 
(      76,     110 ]   383592   1.199%  64.770% 
(     110,     170 ]  7753042  24.228%  88.998% #####
(     170,     250 ]  1978569   6.183%  95.181% #
(     250,     380 ]  1091985   3.412%  98.594% #
(     380,     580 ]   417423   1.304%  99.898% 
(     580,     870 ]    23851   0.075%  99.973% 
(     870,    1300 ]     2058   0.006%  99.979% 
(    1300,    1900 ]     1522   0.005%  99.984% 
(    1900,    2900 ]     2265   0.007%  99.991% 
(    2900,    4400 ]     1358   0.004%  99.995% 
(    4400,    6600 ]      743   0.002%  99.998% 
(    6600,    9900 ]      160   0.001%  99.998% 
(    9900,   14000 ]      146   0.000%  99.999% 
(   14000,   22000 ]      364   0.001% 100.000% 
(   22000,   33000 ]      100   0.000% 100.000% 
(   33000,   50000 ]        2   0.000% 100.000% 
(   50000,   75000 ]        7   0.000% 100.000% 
(  110000,  170000 ]        2   0.000% 100.000% 
(  170000,  250000 ]        2   0.000% 100.000% 

2019/09/20-01:25:30  ... thread 0: (1000000,1000000) ops and (7137.7,7137.7) ops/second in (140.100962,140.100962) seconds
2019/09/20-01:25:30  ... thread 2: (1000000,1000000) ops and (7109.5,7109.5) ops/second in (140.657316,140.657316) seconds
2019/09/20-01:25:31  ... thread 3: (1000000,1000000) ops and (7059.1,7059.1) ops/second in (141.662085,141.662085) seconds
2019/09/20-01:25:32  ... thread 1: (1000000,1000000) ops and (7041.0,7041.0) ops/second in (142.024678,142.024678) seconds
2019/09/20-01:27:48  ... thread 3: (1000000,2000000) ops and (7335.6,7194.7) ops/second in (136.321660,277.983745) seconds
2019/09/20-01:27:48  ... thread 2: (1000000,2000000) ops and (7265.6,7186.7) ops/second in (137.635255,278.292571) seconds
2019/09/20-01:27:51  ... thread 1: (1000000,2000000) ops and (7167.1,7103.5) ops/second in (139.527333,281.552011) seconds
2019/09/20-01:27:56  ... thread 0: (1000000,2000000) ops and (6852.0,6992.0) ops/second in (145.941837,286.042799) seconds
2019/09/20-01:30:07  ... thread 2: (1000000,3000000) ops and (7185.1,7186.2) ops/second in (139.176844,417.469415) seconds
2019/09/20-01:30:09  ... thread 1: (1000000,3000000) ops and (7259.1,7154.6) ops/second in (137.758270,419.310281) seconds
2019/09/20-01:30:11  ... thread 3: (1000000,3000000) ops and (6971.6,7118.7) ops/second in (143.439165,421.422910) seconds
2019/09/20-01:30:15  ... thread 0: (1000000,3000000) ops and (7186.3,7055.6) ops/second in (139.153042,425.195841) seconds
2019/09/20-01:32:25  ... thread 2: (1000000,4000000) ops and (7229.1,7196.9) ops/second in (138.329177,555.798592) seconds
2019/09/20-01:32:28  ... thread 3: (1000000,4000000) ops and (7319.0,7167.8) ops/second in (136.631234,558.054144) seconds
2019/09/20-01:32:35  ... thread 0: (1000000,4000000) ops and (7140.7,7076.7) ops/second in (140.043126,565.238967) seconds
2019/09/20-01:32:35  ... thread 1: (1000000,4000000) ops and (6831.0,7070.9) ops/second in (146.391342,565.701623) seconds
2019/09/20-01:34:46  ... thread 2: (1000000,5000000) ops and (7080.3,7173.2) ops/second in (141.237440,697.036032) seconds
2019/09/20-01:34:46  ... thread 3: (1000000,5000000) ops and (7204.1,7175.0) ops/second in (138.810267,696.864411) seconds
2019/09/20-01:34:55  ... thread 0: (1000000,5000000) ops and (7152.3,7091.7) ops/second in (139.814422,705.053389) seconds
2019/09/20-01:34:55  ... thread 1: (1000000,5000000) ops and (7133.7,7083.3) ops/second in (140.180188,705.881811) seconds
2019/09/20-01:37:09  ... thread 2: (1000000,6000000) ops and (7003.2,7144.3) ops/second in (142.792408,839.828440) seconds
2019/09/20-01:37:11  ... thread 3: (1000000,6000000) ops and (6920.5,7131.3) ops/second in (144.498176,841.362587) seconds
2019/09/20-01:37:15  ... thread 1: (1000000,6000000) ops and (7186.0,7100.2) ops/second in (139.159576,845.041387) seconds
2019/09/20-01:37:15  ... thread 0: (1000000,6000000) ops and (7104.6,7093.8) ops/second in (140.752894,845.806283) seconds
2019/09/20-01:39:29  ... thread 2: (1000000,7000000) ops and (7143.5,7144.2) ops/second in (139.987988,979.816428) seconds
2019/09/20-01:39:29  ... thread 3: (1000000,7000000) ops and (7219.2,7143.7) ops/second in (138.519117,979.881704) seconds
2019/09/20-01:39:34  ... thread 1: (1000000,7000000) ops and (7198.6,7114.1) ops/second in (138.915086,983.956473) seconds
2019/09/20-01:39:48  ... thread 0: (1000000,7000000) ops and (6532.2,7007.7) ops/second in (153.088754,998.895037) seconds
2019/09/20-01:41:47  ... thread 3: (1000000,8000000) ops and (7263.1,7158.4) ops/second in (137.682735,1117.564439) seconds
2019/09/20-01:41:50  ... thread 2: (1000000,8000000) ops and (7092.4,7137.7) ops/second in (140.995773,1120.812201) seconds
2019/09/20-01:41:52  ... thread 1: (1000000,8000000) ops and (7210.2,7126.0) ops/second in (138.691902,1122.648375) seconds
2019/09/20-01:42:15  ... thread 0: (1000000,8000000) ops and (6804.0,6981.6) ops/second in (146.971567,1145.866604) seconds
ycsbf        :      35.814 micros/op 27921 ops/sec;    3.1 MB/s (7999999 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 140.8404  StdDev: 43.46
Min: 1  Median: 137.7378  Max: 60086
Percentiles: P50: 137.74 P75: 169.70 P99: 530.49 P99.9: 780.55 P99.99: 3037.23
------------------------------------------------------
[       0,       1 ]       90   0.000%   0.000% 
(       1,       2 ]     4627   0.014%   0.015% 
(       2,       3 ]    19351   0.060%   0.075% 
(       3,       4 ]    20369   0.064%   0.139% 
(       4,       6 ]    31010   0.097%   0.236% 
(       6,      10 ]   187887   0.587%   0.823% 
(      10,      15 ]  1705569   5.330%   6.153% #
(      15,      22 ]  3544453  11.076%  17.229% ##
(      22,      34 ]  2447986   7.650%  24.879% ##
(      34,      51 ]   529531   1.655%  26.534% 
(      51,      76 ]    80685   0.252%  26.786% 
(      76,     110 ]   484893   1.515%  28.301% 
(     110,     170 ] 15019658  46.936%  75.238% #########
(     170,     250 ]  4527221  14.148%  89.385% ###
(     250,     380 ]  2332712   7.290%  96.675% #
(     380,     580 ]   988701   3.090%  99.765% #
(     580,     870 ]    62552   0.195%  99.960% 
(     870,    1300 ]     3741   0.012%  99.972% 
(    1300,    1900 ]     2251   0.007%  99.979% 
(    1900,    2900 ]     3383   0.011%  99.990% 
(    2900,    4400 ]     1421   0.004%  99.994% 
(    4400,    6600 ]      957   0.003%  99.997% 
(    6600,    9900 ]      254   0.001%  99.998% 
(    9900,   14000 ]      195   0.001%  99.998% 
(   14000,   22000 ]      357   0.001% 100.000% 
(   22000,   33000 ]      143   0.000% 100.000% 
(   33000,   50000 ]        2   0.000% 100.000% 
(   50000,   75000 ]        1   0.000% 100.000% 

2019/09/20-01:47:55  ... thread 1: (1000000,1000000) ops and (2966.5,2966.5) ops/second in (337.096721,337.096721) seconds
2019/09/20-01:48:00  ... thread 3: (1000000,1000000) ops and (2919.9,2919.9) ops/second in (342.476154,342.476154) seconds
2019/09/20-01:48:05  ... thread 0: (1000000,1000000) ops and (2885.1,2885.1) ops/second in (346.606965,346.606965) seconds
2019/09/20-01:48:06  ... thread 2: (1000000,1000000) ops and (2871.9,2871.9) ops/second in (348.202880,348.202880) seconds
2019/09/20-01:53:19  ... thread 1: (1000000,2000000) ops and (3086.9,3025.5) ops/second in (323.953727,661.050448) seconds
2019/09/20-01:53:25  ... thread 2: (1000000,2000000) ops and (3131.2,2995.9) ops/second in (319.367884,667.570764) seconds
2019/09/20-01:53:26  ... thread 0: (1000000,2000000) ops and (3113.0,2994.7) ops/second in (321.233585,667.840550) seconds
2019/09/20-01:53:34  ... thread 3: (1000000,2000000) ops and (2995.9,2957.4) ops/second in (333.794929,676.271083) seconds
ycsbe        :      84.544 micros/op 11828 ops/sec;  124.4 MB/s (1899711 of 2000000 found)
Microseconds per op:
Count: 8000000 Average: 334.0890  StdDev: 423.76
Min: 3  Median: 323.9145  Max: 103858
Percentiles: P50: 323.91 P75: 486.95 P99: 1004.76 P99.9: 1293.59 P99.99: 20655.83
------------------------------------------------------
(       2,       3 ]       46   0.001%   0.001% 
(       3,       4 ]     1662   0.021%   0.021% 
(       4,       6 ]    20189   0.252%   0.274% 
(       6,      10 ]   161639   2.020%   2.294% 
(      10,      15 ]   162337   2.029%   4.323% 
(      15,      22 ]    89752   1.122%   5.445% 
(      22,      34 ]   334564   4.182%   9.627% #
(      34,      51 ]   562422   7.030%  16.658% #
(      51,      76 ]   239403   2.993%  19.650% #
(      76,     110 ]    87916   1.099%  20.749% 
(     110,     170 ]   548841   6.861%  27.610% #
(     170,     250 ]   634133   7.927%  35.536% ##
(     250,     380 ]  2035087  25.439%  60.975% #####
(     380,     580 ]  2098131  26.227%  87.202% #####
(     580,     870 ]   910287  11.379%  98.580% ##
(     870,    1300 ]   107188   1.340%  99.920% 
(    1300,    1900 ]     3213   0.040%  99.960% 
(    1900,    2900 ]      838   0.010%  99.971% 
(    2900,    4400 ]      616   0.008%  99.978% 
(    4400,    6600 ]      230   0.003%  99.981% 
(    6600,    9900 ]      195   0.002%  99.984% 
(    9900,   14000 ]      204   0.003%  99.986% 
(   14000,   22000 ]      369   0.005%  99.991% 
(   22000,   33000 ]      428   0.005%  99.996% 
(   33000,   50000 ]      266   0.003%  99.999% 
(   50000,   75000 ]       42   0.001% 100.000% 
(   75000,  110000 ]        2   0.000% 100.000% 


                               Compactions
Level Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0     15.54     0.00   3280.73
  1     44.98  6147.68   6006.11
  2    276.97 42833.19  41550.49
BucketCount: 800
WriteAmplification: 15.4957

seq# 1535340073, log# 1401, min log#1391, file# 118421